In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5],
                   [np.nan, 3, np.nan, 4]],
                  columns=list('ABCD'))

In [3]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [4]:
df.fillna(-1)

     A    B    C  D
0 -1.0  2.0 -1.0  0
1  3.0  4.0 -1.0  1
2 -1.0 -1.0 -1.0  5
3 -1.0  3.0 -1.0  4

In [5]:
a = 1
b = 1

In [7]:

a == b = c

SyntaxError: can't assign to comparison (<ipython-input-7-3b58e4bcdd92>, line 1)